TestingTool_3-0/src/Catalogs/НаборыТестов/НаборыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыТестов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезНаименования</name>
      <description>Без наименования</description>
    </items>
  </predefined>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНабора</name>
    <type>
      <types>EnumRef.ВидыНаборов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Enums/ВидыНаборов/ВидыНаборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНаборов</name>
  <enumValues>
    <name>ВнешнийКаталогGIT</name>
  </enumValues>
  <enumValues>
    <name>СписокФайлов</name>
  </enumValues>
  <enumValues>
    <name>СписокТестов</name>
  </enumValues>
</mdclass:Enum>

TestingTool_3-0/src/Catalogs/КлючиНастроек/КлючиНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиНастроек</name>
  <predefined>
    <items>
      <name>ПутьКВременномуКаталогуФайлов</name>
      <description>Путь к временному каталогу файлов</description>
    </items>
    <items>
      <name>ПутьКИсполняемомуФайлу1С</name>
      <description>Путь к исполняемому файлу 1С</description>
    </items>
    <items>
      <name>ПутьКИсполняемомуФайлуGIT</name>
      <description>Путь к исполняемому файлу GIT</description>
    </items>
    <items>
      <name>ПутьККаталогуGIT</name>
      <description>Путь к каталогу GIT</description>
    </items>
    <items>
      <name>ПутьККаталогуSoapUI</name>
      <description>Путь к каталогу SoapUI</description>
    </items>
    <items>
      <name>ПутьККаталогуБиблиотекиСценариев</name>
      <description>Путь к каталогу библиотеки сценариев</description>
    </items>
    <items>
      <name>ПутьККаталогуНаборовСценариев</name>
      <description>Путь к каталогу наборов сценариев</description>
    </items>
    <items>
      <name>ПутьККаталогуОтчетовВыполненияТестов</name>
      <description>Путь к каталогу отчетов выполнения тестов</description>
    </items>
    <items>
      <name>ПутьКОбработкеxddTestRunner</name>
      <description>Путь к обработке xddTestRunner</description>
    </items>
    <items>
      <name>ПутьКОбработкеМенеджерСценарногоТеста</name>
      <description>Путь к обработке менеджер сценарного теста</description>
    </items>
    <items>
      <name>ПутьКРабочемуКаталогу</name>
      <description>Путь к рабочему каталогу</description>
    </items>
  </predefined>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНастройки</name>
    <type>
      <types>EnumRef.ТипыКлючейНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКлюча</name>
    <type>
      <types>CatalogRef.ИменаПеременных</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Catalogs/НаборыТестов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьКаталога();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Заголовок = "Выберите каталог"; 
	Если ЗначениеЗаполнено(Объект.ПутьКаталог) Тогда
		Диалог.Каталог = ПредставлениеПутьКаталог;
	КонецЕсли;
	Диалог.МножественныйВыбор = Ложь; 
	ВыборФайлаОткрытияСтруктурыКаталога = новый ОписаниеОповещения("ВыборФайлаОткрытияКаталога",ЭтотОбъект,Новый Структура("ИмяКаталога","ПутьКаталог"));
	Диалог.Показать(ВыборФайлаОткрытияСтруктурыКаталога);

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаОткрытияКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ИмяКаталога = "";
		Если ДополнительныеПараметры.Свойство("ИмяКаталога",ИмяКаталога) Тогда
			ПредставлениеПутьКаталог = ВыбранныеФайлы[0]; 
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНабораПриИзменении(Элемент)
	УстановитьВидимостьКаталога();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКаталога()
	
	Элементы.ГруппаКаталог.Видимость = (Объект.ВидНабора=ПредопределенноеЗначение("Перечисление.ВидыНаборов.ВнешнийКаталогGIT"));
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// если в гит, тогда добавим путь
	ПолучитьПредставлениеПутьКаталог();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПредставлениеПутьКаталог()
	
	Если Объект.ВидНабора=ПредопределенноеЗначение("Перечисление.ВидыНаборов.ВнешнийКаталогGIT") Тогда
		СоответствиеНастроекПользователя = СценарноеТестированиеВызовСервера.ПолучитьСоответствиеНастроекПользователя(ПользователиКлиентСервер.ТекущийПользователь(),ПользователиКлиентСервер.ТекущееРабочееМесто());
		ИмяКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.КлючиНастроек.ПутьККаталогуGIT,"ИмяКлюча");
		ПутьКаталогGIT = СоответствиеНастроекПользователя.Получить(ИмяКлюча);
		Если ПутьКаталогGIT=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПутьКаталогGIT) Тогда
			ВызватьИсключение "Не указана настройка для текущего пользователя 'ПутьКаталогGIT' или она не заполнена";
		КонецЕсли;		
		ПредставлениеПутьКаталог = ПутьКаталогGIT+"\"+Объект.ПутьКаталог;
	Иначе
		ПредставлениеПутьКаталог = Объект.ПутьКаталог;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПолучитьПредставлениеПутьКаталог();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СформироватьПутьКаталогПоПредставлению(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура СформироватьПутьКаталогПоПредставлению(ТекущийОбъект)
	
	Если Объект.ВидНабора=ПредопределенноеЗначение("Перечисление.ВидыНаборов.ВнешнийКаталогGIT") Тогда
		СоответствиеНастроекПользователя = СценарноеТестированиеВызовСервера.ПолучитьСоответствиеНастроекПользователя(ПользователиКлиентСервер.ТекущийПользователь(),ПользователиКлиентСервер.ТекущееРабочееМесто());
		ИмяКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.КлючиНастроек.ПутьККаталогуGIT,"ИмяКлюча");
		ПутьКаталогGIT = СоответствиеНастроекПользователя.Получить(ИмяКлюча);
		Если ПутьКаталогGIT=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПутьКаталогGIT) Тогда
			ВызватьИсключение "Не указана настройка для текущего пользователя 'ПутьКаталогGIT' или она не заполнена";
		КонецЕсли;		
		ПутьКаталог = СтрЗаменить(Врег(ПредставлениеПутьКаталог),Врег(ПутьКаталогGIT),"");
		ТекущийОбъект.ПутьКаталог = Прав(ПутьКаталог,СтрДлина(ПутьКаталог)-1);
	Иначе
		ТекущийОбъект.ПутьКаталог = ПредставлениеПутьКаталог;
	КонецЕсли;
	
КонецПроцедуры
